OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
        while ((i3c->DEVCTL & I3C_DEVCTL_RESUME_Msk) == I3C_DEVCTL_RESUME_Msk) {}

        /* RESUME bit is auto-cleared once the controller is ready to accept new transfers. */
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief      Get Resopnse Status and Receive Data
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[out] pu32RespQ       The response data structure to get the response data.
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  * @retval     I3C_STS_RESPQ_EMPTY     No Response Queue data
  * @return     Response error status
  *
  * @details    This API is used to get the response data and the received data on Master write operation.
  */
int32_t I3C_ParseRespQueue(I3C_T *i3c, uint32_t *pu32RespQ)
{
    uint8_t qn, u8RespQCnt;

    /* Check if RespQ buffer is empty */
    if (pu32RespQ == NULL)
    {
        return I3C_STS_INVALID_INPUT;
    }

    /* Check if RespQ is empty */
    if (I3C_IS_RESPQ_EMPTY(i3c))
    {
        return I3C_STS_RESPQ_EMPTY;
    }

    u8RespQCnt = I3C_GET_RESPQ_THLD(i3c) + 1;
    qn = 0; // Queue number

    do
    {
        pu32RespQ[qn] = I3C_GET_RESP_DATA(i3c);

        if (!I3C_IS_RESP_NO_ERR(pu32RespQ[qn]))
        {
            return (pu32RespQ[qn] & I3C_RESPQUE_ERRSTS_Msk);
        }

        qn++;
        u8RespQCnt--;
    } while (u8RespQCnt);

    return I3C_STS_NO_ERR;
}

/**
  * @brief      Set Command Queue and Transmit Data for Master Read
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u8TID           Specified Transmit Transaction ID in Command Queue.
  * @param[in]  pu32TxBuf       The buffer to send the data to transmit FIFO.
  * @param[in]  u16WriteBytes   The byte number of TX data.
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  * @retval     I3C_STS_CMDQ_FULL       Command Queue is full
  * @retval     I3C_STS_TX_FULL         TX FIFO is full
  *
  * @details    This API is used to prepare a Command Queue and TX response data for Master read operation.
  */
int32_t I3C_SetCmdQueueAndData(I3C_T *i3c, uint8_t u8TID, uint32_t *pu32TxBuf, uint16_t u16WriteBytes)
{
    uint32_t i;

    /* Check if write bytes is exceeded */
    if (u16WriteBytes > (I3C_DEVICE_TX_BUF_CNT * 4))
    {
        return I3C_STS_INVALID_INPUT;
    }

    /* Check if CmdQ is full */
    if (I3C_IS_CMDQ_FULL(i3c))
    {
        return I3C_STS_CMDQ_FULL;
    }

    if (pu32TxBuf != NULL)
    {
        for (i = 0; i < ((u16WriteBytes + 3) / 4); i++)
        {
            /* Check if TX buffer is full */
            if (I3C_IS_TX_FULL(i3c))
            {
                return I3C_STS_TX_FULL;
            }

            i3c->TXRXDAT = pu32TxBuf[i];
        }
    }

    i3c->CMDQUE = ((u8TID << I3C_CMDQUE_TID_Pos) | (u16WriteBytes << I3C_CMDQUE_DATLEN_Pos));
    return I3C_STS_NO_ERR;
}

/**
  * @brief      Generate IBI Request
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u8MandatoryData The mandatory data byte.
  * @param[in]  u32PayloadData  The payload data.
  * @param[in]  u8PayloadLen    The byte number of payload data. The maximum length is 4 bytes.
  *
  * @retval     I3C_STS_NO_ERR              No error, IBI request accepted by the Master
  * @retval     I3C_STS_INVALID_STATE       Invalid state
  * @retval     I3C_STS_INVALID_INPUT       Invalid input parameter
  *
  * @details    This API is used to generate an IBI request on the bus.
  */
int32_t I3C_SendIBIRequest(I3C_T *i3c, uint8_t u8MandatoryData, uint32_t u32PayloadData, uint8_t u8PayloadLen)
{
    /* Check if Controller is in busy state */
    if (I3C_IS_SLAVE_BUSY(i3c))
    {
        return I3C_STS_INVALID_STATE;
    }

    /* Check if SIR function enabled */
    if (!(i3c->SLVEVNTS & I3C_SLVEVNTS_SIREN_Msk))
    {
        return I3C_STS_INVALID_STATE;
    }

    /* Clear CmdQ and Tx buffer */
    //    if (I3C_ResetAndResume(i3c, (I3C_RESET_CMD_QUEUE | I3C_RESET_TX_BUF), FALSE) != 0)
    //    {
    //        return I3C_STS_INVALID_STATE;
    //    }

    /* Check if payload length > 4-bytes */
    if (u8PayloadLen > 4)
    {
        return I3C_STS_INVALID_INPUT;
    }

    /* Program IBI payload data, payload length and MDB */
    i3c->SIR = (u8PayloadLen << I3C_SIR_DATLEN_Pos) | (u8MandatoryData << I3C_SIR_MDB_Pos) | (0 << I3C_SIR_CTL_Pos);
    i3c->SIRDAT = u32PayloadData;
    /* Trigger IBI request */
    /* SIR_EN bit be cleared automatically after the Master accepts the IBI request or Slave unable to issue the IBI request */
    i3c->SIR |= I3C_SIR_EN_Msk;
    return I3C_STS_NO_ERR;
}

/**
  * @brief      Enable HJ Generation
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u32ModeSel      Select the Hot-Join generation method. Valid values are:
  *                                 - \ref I3C_SUPPORT_ADAPTIVE_HJ
  *                                 - \ref I3C_SUPPORT_IMMEDIATE_HJ
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_TIMEOUT_ERR         Enable/Disable I3C time-out
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  *
  * @details    This API is used to enable the specified HJ generation after enable I3C controller again.
  * @note       I3C Slave controller does not recognize the ENTDAA CCC after enabling the HJ generation.
  */
int32_t I3C_EnableHJRequest(I3C_T *i3c, uint32_t u32ModeSel)
{
    volatile uint32_t u32Timeout;
    I3C_ResetAndResume(i3c, I3C_RESET_ALL_QUEUE_AND_BUF, FALSE);

    /* Disable I3C controller */
    if (I3C_Disable(i3c) != I3C_STS_NO_ERR)
    {
        return I3C_TIMEOUT_ERR;
    }

    /* Select the slave ability for enter I3C mode */
    if (u32ModeSel == I3C_SUPPORT_ADAPTIVE_HJ)
    {
        /* Both ADAPTIVE and HJEN enabled: Slave generates a Hot-Join request until receive I3C header 7'h7E on the bus */
        i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
        i3c->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
    }
    else if (u32ModeSel == I3C_SUPPORT_IMMEDIATE_HJ)
    {
        /* Only HJEN enabled: Slave generates a Hot-Join request immediately */
        i3c->DEVCTL &= ~I3C_DEVCTL_ADAPTIVE_Msk;
        i3c->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
    }
    else
    {
        /* HJEN disabled: Slave supports ENTDAA CCC */
        i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
        i3c->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;

