OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
        /* Enable I3C controller */
        if (I3C_Enable(i3c) != I3C_STS_NO_ERR)
        {
            return I3C_TIMEOUT_ERR;
        }

        return I3C_STS_INVALID_INPUT;
    }

    /* Enable I3C controller */
    if (I3C_Enable(i3c) != I3C_STS_NO_ERR)
    {
        return I3C_TIMEOUT_ERR;
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief      Disable HJ Generation
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  *
  * @retval     I3C_STS_NO_ERR      No error
  * @retval     I3C_TIMEOUT_ERR     Enable/Disable I3C time-out
  *
  * @details    This API is used to disable the HJ generation.
  * @note       I3C Slave controller can recognize the ENTDAA CCC after disabling the HJ generation.
  */
int32_t I3C_DisableHJRequest(I3C_T *i3c)
{
    /* Disable I3C controller */
    if (I3C_Disable(i3c) != I3C_STS_NO_ERR)
    {
        return I3C_TIMEOUT_ERR;
    }

    /* HJEN disabled: Slave supports ENTDAA CCC */
    i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
    i3c->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;

    /* Enable I3C controller */
    if (I3C_Enable(i3c) != I3C_STS_NO_ERR)
    {
        return I3C_TIMEOUT_ERR;
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief      I3C Response Error Recovery
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u32RespStatus   Response error status from the response queue.
  *
  * @return     I3C_STS_NO_ERR
  *
  * @details    This API is used to perform error recovery then the I3C Slave controller can leave Halt(Busy) state.
  * @note       The RESUME operation is completed after a GETSTATUS CCC is received or the specified Master operation is successfully.
  */
int32_t I3C_RespErrorRecovery(I3C_T *i3c, uint32_t u32RespStatus)
{
    if (u32RespStatus != I3C_STS_NO_ERR)
    {
        if (I3C_IS_SLAVE_BUSY(i3c))
        {
            switch (u32RespStatus)
            {
                case I3C_RESP_CRC_ERR:
                case I3C_RESP_PARITY_ERR:
                case I3C_RESP_FRAME_ERR:
                case I3C_RESP_FLOW_ERR:
                    /* Reset RX FIFO -> apply resume */
                    I3C_ResetAndResume(i3c, I3C_RESET_RX_BUF, TRUE);
                    break;

                case I3C_RESP_MASTER_TERMINATE_ERR:
                    /* Reset TX FIFO and CMDQ Queue -> apply resume */
                    I3C_ResetAndResume(i3c, (I3C_RESET_TX_BUF | I3C_RESET_CMD_QUEUE), TRUE);
                    break;

                default:
                    /* Reset all FIFO and Queue */
                    I3C_ResetAndResume(i3c, I3C_RESET_ALL_QUEUE_AND_BUF, FALSE);
                    break;
            }
        }
    }

    return I3C_STS_NO_ERR;
}


/**
  * @brief      Setup I2C / I3C Device Address Table
  *
  * @param[in]  *i3c            Point to I3C peripheral
  * @param[in]  u8DevIndex      the offset of Device Address Table.
  *                             It could be 0 ~ 6 for DEV1ADR to DEV7ADR.
  * @param[in]  u8DevType       the slave device type. It could be I3C_DEVTYPE_I3C for I3C device and I3C_DEVTYPE_I2C for I2C device
  * @param[in]  u8DAddr         7Bits Device Synamic Address
  * @param[in]  u8SAddr         7Bits Device Static Address
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  *
  * @details    The function is used for I3C Master to setup Device Address Table.
  * @note       Device Address Table must be set before communication with Slave Devices.
  *
  */
int32_t I3C_SetDeviceAddr(I3C_T *i3c, uint8_t u8DevIndex, uint8_t u8DevType, uint8_t u8DAddr, int8_t u8SAddr)
{
    uint32_t i, count, u32Device = 0;

    if ((u8DAddr & 0x80) || (u8SAddr & 0x80))
    {
        return I3C_STS_INVALID_INPUT;
    }

    // I3C Device Dynamic Address with Odd Parity
    for (i = 0, count = 0; i < 8; i++)
    {
        if ((u8DAddr >> i) & 0x1)
        {
            count ++;
        }
    }

    if ((count % 2) == 0)
    {
        u32Device = ((u8DAddr | 0x80) << I3C_DEVADR_DADDR_Pos);
    }
    else
    {
        u32Device = (u8DAddr << I3C_DEVADR_DADDR_Pos);
    }

    // I2C Device Static Address
    u32Device |= (u8SAddr << I3C_DEVADR_SADDR_Pos);

    // Device Type
    if (u8DevType != I3C_DEVTYPE_I3C)
    {
        u32Device |= I3C_DEVADR_DEVICE_Msk;
    }

    switch (u8DevIndex)
    {
        case 0ul:
            i3c->DEV1ADR = u32Device;
            break;

        case 1ul:
            i3c->DEV2ADR = u32Device;
            break;

        case 2ul:
            i3c->DEV3ADR = u32Device;
            break;

        case 3ul:
            i3c->DEV4ADR = u32Device;
            break;

        case 4ul:
            i3c->DEV5ADR = u32Device;
            break;

        case 5ul:
            i3c->DEV6ADR = u32Device;
            break;

        case 6ul:
            i3c->DEV7ADR = u32Device;
            break;

        default:
            return I3C_STS_INVALID_INPUT;
            break;
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief      Write data to Slave
  *
  * @param[in]  *i3c            Point to I3C peripheral
  * @param[in]  u8DevIndex      the offset of Device Address Table.
  *                             It could be 0 ~ 6 for DEV1ADR to DEV7ADR.
  * @param[in]  u32Speed        the speed in which the transfer should be driven. It could be
  *                                 \ref I3C_DEVI3C_SPEED_SDR0
  *                                 \ref I3C_DEVI3C_SPEED_SDR1
  *                                 \ref I3C_DEVI3C_SPEED_SDR2
  *                                 \ref I3C_DEVI3C_SPEED_SDR3
  *                                 \ref I3C_DEVI3C_SPEED_SDR4
  *                                 \ref I3C_DEVI3C_SPEED_HDRDDR
  *                                 \ref I3C_DEVI3C_SPEED_I2CFM
  *                                 \ref I3C_DEVI2C_SPEED_I2CFM
  *                                 \ref I3C_DEVI2C_SPEED_I2CFMPLUS
  * @param[in]  *pu32TxBuf      Pointer to array to write data to Slave
  * @param[in]  u16WriteBytes   How many bytes need to write to Slave
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  * @retval     I3C_STS_CMDQ_FULL       Command Queue is full
  * @retval     I3C_STS_TX_FULL         TX FIFO is full
  *
  * @details    The function is used for I3C Master write data to Slave.
  *
  * @note       Device Address Table must be set before using this function.
  *
  */
int32_t I3C_Write(I3C_T *i3c, uint8_t u8DevIndex, uint32_t u32Speed, uint32_t *pu32TxBuf, uint16_t u16WriteBytes)
{
    uint32_t i;
    uint32_t u32TimeOutCount = 0u;
    uint32_t response;

    if ((u16WriteBytes == 0) || (pu32TxBuf == NULL))
    {
        return I3C_STS_INVALID_INPUT;
    }

