OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
    while ((i3c->INTSTS & I3C_INTSTS_RESPRDY_Msk) == 0);

    response = i3c->RESPQUE;
    error = (response & I3C_RESPQUE_ERRSTS_Msk);

    if (i3c->INTSTS & I3C_INTSTS_TFRERR_Msk)
    {
        i3c->INTSTS |= I3C_INTSTS_TFRERR_Msk;
    }

    if (error == I3C_RESP_NO_ERR)
    {
        return u8DevCount;
    }
    else if (error == I3C_RESP_BROADCAST_ADDR_NACK_ERR)
    {
        i3c->DEVCTL |= I3C_DEVCTL_RESUME_Msk;
        /*
            The controller writes the transfer complete status into the Command Response queue. The Data
            Length Field of Response Data Structure indicates remaining device count in case if the transfer is
            terminated abruptly due to NACK response from the target.
        */
        return (u8DevCount - (response & I3C_RESPQUE_DATLEN_Msk));
    }
    else
    {
        i3c->DEVCTL |= I3C_DEVCTL_RESUME_Msk;
        return I3C_STS_INVALID_STATE;
    }
}

/**
  * @brief      Unicast SETDASA command
  *
  * @param[in]  *i3c            Point to I3C peripheral
  * @param[in]  u8DevIndex      the offset of Device Address Table.
  *                             It could be 0 ~ 6 for DEV1ADR to DEV7ADR.
  *
  * @retval     I3C_STS_NO_ERR              No error
  * @retval     I3C_STS_INVALID_STATE       Invalid state
  * @details    The function is used for I3C Master.
  * @note       Device Address Table must be set before using this function.
  *
  */

int32_t I3C_UnicastSETDASA(I3C_T *i3c, uint8_t u8DevIndex)
{
    uint32_t response;
    i3c->CMDQUE = (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk
                   | (1 << I3C_CMDQUE_DEVCOUNT_Pos)
                   | ((u8DevIndex & 0x1F) << I3C_CMDQUE_DEVINDX_Pos)
                   | (I3C_CCC_SETDASA <<  I3C_CMDQUE_CMD_Pos)
                   | I3C_CMDATTR_ADDR_ASSGN_CMD);

    while ((i3c->INTSTS & I3C_INTSTS_RESPRDY_Msk) == 0);

    response = i3c->RESPQUE;

    if (response & I3C_RESPQUE_ERRSTS_Msk)
    {
        i3c->DEVCTL |= I3C_DEVCTL_RESUME_Msk;
        return I3C_STS_INVALID_STATE;
    }

    return I3C_STS_NO_ERR;
}


/** @} end of group I3C_EXPORTED_FUNCTIONS */
/** @} end of group I3C_Driver */
/** @} end of group Standard_Driver */
